{
  "activation_dropout": 0.1,
  "activation_function": "gelu",
  "add_bias_logits": false,
  "add_final_layer_norm": false,
  "architectures": [
    "BartForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": 0,
  "classif_dropout": 0.1,
  "classifier_dropout": 0.0,
  "d_model": 768,
  "decoder_attention_heads": 12,
  "decoder_ffn_dim": 3072,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 6,
  "decoder_start_token_id": 2,
  "dropout": 0.1,
  "early_stopping": true,
  "encoder_attention_heads": 12,
  "encoder_ffn_dim": 3072,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 6,
  "eos_token_id": 2,
  "forced_bos_token_id": 0,
  "forced_eos_token_id": 2,
  "gradient_checkpointing": false,
  "id2label": {
    "0": "Career change",
    "1": "Entrepreneurship",
    "2": "Further Education",
    "3": "Heavy workload / Burnout",
    "4": "Insufficient training or mentoring",
    "5": "Lack of career growth",
    "6": "Lack of recognition",
    "7": "Limited work-life balance",
    "8": "Management or leadership issues",
    "9": "Other / Unclear",
    "10": "Poor compensation or benefits",
    "11": "Relocation or personal reasons",
    "12": "Toxic culture or team dynamics"
  },
  "init_std": 0.02,
  "is_encoder_decoder": true,
  "label2id": {
    "Career change": 0,
    "Entrepreneurship": 1,
    "Further Education": 2,
    "Heavy workload / Burnout": 3,
    "Insufficient training or mentoring": 4,
    "Lack of career growth": 5,
    "Lack of recognition": 6,
    "Limited work-life balance": 7,
    "Management or leadership issues": 8,
    "Other / Unclear": 9,
    "Poor compensation or benefits": 10,
    "Relocation or personal reasons": 11,
    "Toxic culture or team dynamics": 12
  },
  "max_position_embeddings": 1024,
  "model_type": "bart",
  "no_repeat_ngram_size": 3,
  "normalize_before": false,
  "normalize_embedding": true,
  "num_beams": 4,
  "num_hidden_layers": 6,
  "pad_token_id": 1,
  "problem_type": "single_label_classification",
  "scale_embedding": false,
  "task_specific_params": {
    "summarization": {
      "length_penalty": 1.0,
      "max_length": 128,
      "min_length": 12,
      "num_beams": 4
    },
    "summarization_cnn": {
      "length_penalty": 2.0,
      "max_length": 142,
      "min_length": 56,
      "num_beams": 4
    },
    "summarization_xsum": {
      "length_penalty": 1.0,
      "max_length": 62,
      "min_length": 11,
      "num_beams": 6
    }
  },
  "torch_dtype": "float32",
  "transformers_version": "4.53.1",
  "use_cache": true,
  "vocab_size": 50265
}
